{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "square", "data_format": "channels_first", "filters": 1, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dtype": "float32", "trainable": true, "batch_input_shape": [null, 1, 4, 4], "bias_constraint": null, "strides": [1, 1], "padding": "same"}}, {"class_name": "Flatten", "config": {"data_format": "channels_first", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "units": 32, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null}}], "name": "sequential_1"}}