{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 784], "activation": "linear"}}]}, "backend": "tensorflow", "keras_version": "2.2.4"}